-- phpMyAdmin SQL Dump
-- version 4.4.15.10
-- https://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2021 年 9 月 16 日 10:13
-- サーバのバージョン： 10.5.11-MariaDB-log
-- PHP Version: 5.4.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tyokogawa_ec2`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `dtb_category`
--

CREATE TABLE IF NOT EXISTS `dtb_category` (
  `id` int(10) unsigned NOT NULL,
  `parent_category_id` int(10) unsigned DEFAULT NULL,
  `creator_id` int(10) unsigned DEFAULT NULL,
  `category_name` varchar(255) NOT NULL,
  `hierarchy` int(10) unsigned NOT NULL,
  `sort_no` int(11) NOT NULL,
  `create_date` datetime NOT NULL COMMENT '(DC2Type:datetimetz)',
  `update_date` datetime NOT NULL COMMENT '(DC2Type:datetimetz)',
  `discriminator_type` varchar(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=63 DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `dtb_category`
--

INSERT INTO `dtb_category` (`id`, `parent_category_id`, `creator_id`, `category_name`, `hierarchy`, `sort_no`, `create_date`, `update_date`, `discriminator_type`) VALUES
(1, NULL, 1, '【店頭購入のみ】プチガトー', 1, 1, '2021-09-08 02:29:44', '2021-09-08 02:29:44', 'category'),
(2, NULL, 1, '【店頭購入のみ】ロールケーキ', 1, 2, '2021-09-08 02:29:49', '2021-09-08 02:29:49', 'category'),
(3, NULL, 1, 'バームクーヘン', 1, 3, '2021-09-08 02:29:54', '2021-09-08 02:29:54', 'category'),
(4, NULL, 1, 'マドレーヌ・フィナンシェ', 1, 4, '2021-09-08 02:30:00', '2021-09-08 02:30:00', 'category'),
(5, NULL, 1, 'パウンドケーキ', 1, 5, '2021-09-08 02:30:05', '2021-09-08 02:30:05', 'category'),
(6, NULL, 1, 'クッキー・焼き菓子', 1, 6, '2021-09-08 02:30:10', '2021-09-08 02:30:10', 'category'),
(7, NULL, 1, '要冷蔵菓子', 1, 7, '2021-09-08 02:30:15', '2021-09-08 02:30:15', 'category'),
(8, NULL, 1, 'コンフィチュール・ハチミツ', 1, 8, '2021-09-08 02:30:19', '2021-09-08 02:30:19', 'category'),
(9, NULL, 1, 'ドーナツ・カステラ', 1, 9, '2021-09-08 02:30:24', '2021-09-08 02:30:24', 'category'),
(10, NULL, 1, '有料手提げ袋', 1, 10, '2021-09-08 02:30:29', '2021-09-08 02:30:29', 'category'),
(11, NULL, 1, '【店頭受取】デコレーションケーキ', 1, 11, '2021-09-08 02:30:34', '2021-09-08 02:30:34', 'category'),
(12, NULL, 1, '【店頭受取】クッキー・焼き菓子', 1, 12, '2021-09-08 02:30:38', '2021-09-08 02:30:38', 'category'),
(13, NULL, 1, '【店頭受取】バームクーヘン', 1, 13, '2021-09-08 02:30:42', '2021-09-08 02:30:42', 'category'),
(14, NULL, 1, '【店頭受取】マドレーヌ・フィナンシェ', 1, 14, '2021-09-08 02:30:49', '2021-09-08 02:30:49', 'category'),
(15, NULL, 1, '【店頭受取】有料手提げ袋', 1, 15, '2021-09-08 02:30:55', '2021-09-08 02:30:55', 'category'),
(16, NULL, 1, '用途別', 1, 16, '2021-09-08 02:31:12', '2021-09-08 02:31:12', 'category'),
(17, NULL, 1, '身近な人へのお礼として', 1, 17, '2021-09-08 02:31:18', '2021-09-08 02:31:18', 'category'),
(18, NULL, 1, 'お中元・お歳暮として', 1, 18, '2021-09-08 02:31:25', '2021-09-08 02:31:25', 'category'),
(19, NULL, 1, '内祝いとして', 1, 19, '2021-09-08 02:31:30', '2021-09-08 02:31:30', 'category'),
(20, NULL, 1, '法事のお供えとして', 1, 20, '2021-09-08 02:31:35', '2021-09-08 02:31:35', 'category'),
(21, NULL, 1, '【店頭受取】用途別', 1, 21, '2021-09-08 02:31:42', '2021-09-08 02:31:42', 'category'),
(22, NULL, 1, '【店頭受取】身近な人へのお礼として', 1, 22, '2021-09-08 02:31:50', '2021-09-08 02:31:50', 'category'),
(23, NULL, 1, '【店頭受取】お中元・お歳暮として', 1, 23, '2021-09-08 02:31:56', '2021-09-08 02:31:56', 'category'),
(24, NULL, 1, '【店頭受取】内祝いとして', 1, 24, '2021-09-08 02:32:01', '2021-09-08 02:32:01', 'category'),
(25, NULL, 1, '【店頭受取】法事のお供えとして', 1, 25, '2021-09-08 02:32:16', '2021-09-08 02:32:16', 'category'),
(26, NULL, 1, '価格別', 1, 26, '2021-09-08 02:32:23', '2021-09-08 02:32:23', 'category'),
(27, NULL, 1, '2160円まで', 1, 27, '2021-09-08 02:32:28', '2021-09-08 02:32:28', 'category'),
(28, NULL, 1, '2160円から3780円', 1, 28, '2021-09-08 02:32:33', '2021-09-08 02:32:33', 'category'),
(29, NULL, 1, '3780円以上', 1, 29, '2021-09-08 02:32:38', '2021-09-08 02:32:38', 'category'),
(30, NULL, 1, '【店頭受取】価格別', 1, 30, '2021-09-08 02:32:44', '2021-09-08 02:32:44', 'category'),
(31, NULL, 1, '【店頭受取】2160円まで', 1, 31, '2021-09-08 02:32:52', '2021-09-08 02:32:52', 'category'),
(32, NULL, 1, '【店頭受取】2160円から3780円', 1, 32, '2021-09-08 02:33:01', '2021-09-08 02:33:01', 'category'),
(33, NULL, 1, '【店頭受取】3780円以上', 1, 33, '2021-09-08 02:33:07', '2021-09-08 02:33:07', 'category'),
(34, NULL, 1, '季節の商品', 1, 34, '2021-09-08 02:33:15', '2021-09-08 02:33:15', 'category'),
(35, NULL, 1, 'チョコレート', 1, 35, '2021-09-08 02:34:44', '2021-09-08 02:34:44', 'category'),
(36, NULL, 1, '【店頭受取】チョコレート', 1, 36, '2021-09-08 02:34:51', '2021-09-08 02:34:51', 'category'),
(37, NULL, 1, '限定スイーツ', 1, 37, '2021-09-08 02:34:55', '2021-09-08 02:34:55', 'category'),
(38, NULL, 1, '【店頭受取】限定スイーツ', 1, 38, '2021-09-08 02:35:11', '2021-09-08 02:35:11', 'category'),
(39, NULL, 1, '【店頭受取】パウンドケーキ', 1, 39, '2021-09-08 02:35:16', '2021-09-08 02:35:16', 'category'),
(40, NULL, 1, '【店頭受取】要冷蔵菓子', 1, 40, '2021-09-08 02:35:20', '2021-09-08 02:35:20', 'category'),
(41, NULL, 1, '【店頭受取】ドーナツ・カステラ', 1, 41, '2021-09-08 02:35:24', '2021-09-08 02:35:24', 'category'),
(42, NULL, 1, '【店頭受取】コンフィチュール・ハチミツ', 1, 42, '2021-09-08 02:35:30', '2021-09-08 02:35:30', 'category'),
(43, NULL, 1, 'クリスマス', 1, 43, '2021-09-08 02:35:59', '2021-09-08 02:35:59', 'category'),
(44, NULL, 1, 'クリスマスギフト', 1, 44, '2021-09-08 02:36:04', '2021-09-08 02:36:04', 'category'),
(45, NULL, 1, '【店頭受取】クリスマスギフト', 1, 45, '2021-09-08 02:36:10', '2021-09-08 02:36:10', 'category'),
(46, NULL, 1, 'バレンタイン', 1, 46, '2021-09-08 02:36:14', '2021-09-08 02:36:14', 'category'),
(47, NULL, 1, '【店頭受取】バレンタイン', 1, 47, '2021-09-08 02:36:18', '2021-09-08 02:36:18', 'category'),
(48, NULL, 1, 'ひなまつり', 1, 48, '2021-09-08 02:36:23', '2021-09-08 02:36:23', 'category'),
(49, NULL, 1, '【店頭受取】ひなまつり', 1, 49, '2021-09-08 02:36:27', '2021-09-08 02:36:27', 'category'),
(50, NULL, 1, 'こどもの日', 1, 50, '2021-09-08 02:36:32', '2021-09-08 02:36:32', 'category'),
(51, NULL, 1, '【店頭受取】こどもの日', 1, 51, '2021-09-08 02:36:37', '2021-09-08 02:36:37', 'category'),
(52, NULL, 1, '母の日', 1, 52, '2021-09-08 02:36:42', '2021-09-08 02:36:42', 'category'),
(53, NULL, 1, '【店頭受取】母の日', 1, 53, '2021-09-08 02:36:47', '2021-09-08 02:36:47', 'category'),
(54, NULL, 1, 'ソルベ、ゼリー', 1, 54, '2021-09-08 02:36:53', '2021-09-08 02:36:53', 'category'),
(55, NULL, 1, '【店頭受取】ソルベ、ゼリー', 1, 55, '2021-09-08 02:36:57', '2021-09-08 02:36:57', 'category'),
(56, NULL, 1, 'サンプル', 1, 56, '2021-09-08 02:37:02', '2021-09-08 02:37:02', 'category'),
(57, NULL, 1, 'サマーギフト', 1, 57, '2021-09-08 02:37:07', '2021-09-08 02:37:07', 'category'),
(58, NULL, 1, '【店頭受取】サマーギフト', 1, 58, '2021-09-08 02:37:11', '2021-09-08 02:37:11', 'category'),
(59, NULL, 1, '店頭受取', 1, 59, '2021-09-08 02:37:23', '2021-09-08 02:37:23', 'category'),
(60, NULL, 1, '店頭購入のみ', 1, 60, '2021-09-08 02:37:44', '2021-09-08 02:37:44', 'category'),
(61, NULL, 1, 'ケーキ一覧', 1, 62, '2021-09-15 00:53:40', '2021-09-15 00:53:40', 'category'),
(62, 61, 1, 'デコレーション', 2, 61, '2021-09-15 00:53:49', '2021-09-15 00:53:49', 'category');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `dtb_category`
--
ALTER TABLE `dtb_category`
  ADD PRIMARY KEY (`id`),
  ADD KEY `IDX_5ED2C2B796A8F92` (`parent_category_id`),
  ADD KEY `IDX_5ED2C2B61220EA6` (`creator_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `dtb_category`
--
ALTER TABLE `dtb_category`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=63;
--
-- ダンプしたテーブルの制約
--

--
-- テーブルの制約 `dtb_category`
--
ALTER TABLE `dtb_category`
  ADD CONSTRAINT `FK_5ED2C2B61220EA6` FOREIGN KEY (`creator_id`) REFERENCES `dtb_member` (`id`),
  ADD CONSTRAINT `FK_5ED2C2B796A8F92` FOREIGN KEY (`parent_category_id`) REFERENCES `dtb_category` (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
